#### Terraform Plan (`success`)

<details>

<summary>Show Plan</summary>

```terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/VolodymyrOleksiienko/spec-forge-infra/runs/run-bW6CQc44wzmob1TZ

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
data.local_file.docker_compose: Refreshing...
data.local_file.docker_compose: Refresh complete after 0s [id=40f976d5ac6f4eee82f76145c679fcd57ae3c3d6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_domain.default will be created
  + resource "digitalocean_domain" "default" {
      + id         = (known after apply)
      + ip_address = (known after apply)
      + name       = "v-oleksiienko.xyz"
      + ttl        = (known after apply)
      + urn        = (known after apply)
    }

  # digitalocean_droplet.web will be created
  + resource "digitalocean_droplet" "web" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-24-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "spec-forge-server"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "ams3"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + ssh_keys             = (known after apply)
      + status               = (known after apply)
      + tags                 = [
          + "env-prod",
          + "project-spec-forge",
        ]
      + urn                  = (known after apply)
      + user_data            = "33e3e9cf476798f9ed95c57dc271c2c77b006111"
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_firewall.web will be created
  + resource "digitalocean_firewall" "web" {
      + created_at      = (known after apply)
      + droplet_ids     = (known after apply)
      + id              = (known after apply)
      + name            = "spec-forge-firewall"
      + pending_changes = (known after apply)
      + status          = (known after apply)
      + tags            = [
          + "env-prod",
          + "project-spec-forge",
        ]

      + inbound_rule {
          + port_range                = "22"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "443"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "80"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "tcp"
        }
    }

  # digitalocean_record.www will be created
  + resource "digitalocean_record" "www" {
      + domain = "v-oleksiienko.xyz"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www"
      + ttl    = 1800
      + type   = "A"
      + value  = (known after apply)
    }

  # digitalocean_reserved_ip.static_ip will be created
  + resource "digitalocean_reserved_ip" "static_ip" {
      + id         = (known after apply)
      + ip_address = (known after apply)
      + region     = "ams3"
      + urn        = (known after apply)
    }

  # digitalocean_reserved_ip_assignment.assign will be created
  + resource "digitalocean_reserved_ip_assignment" "assign" {
      + droplet_id = (known after apply)
      + id         = (known after apply)
      + ip_address = (known after apply)
    }

  # digitalocean_ssh_key.default will be created
  + resource "digitalocean_ssh_key" "default" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "github-actions-key"
      + public_key  = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINAm8GV9flLHfk7FKNXGDM54yXcPKPdtMnj0EuwRFghU git-actions"
    }

  # digitalocean_volume.data will be created
  + resource "digitalocean_volume" "data" {
      + droplet_ids             = (known after apply)
      + filesystem_label        = (known after apply)
      + filesystem_type         = (known after apply)
      + id                      = (known after apply)
      + initial_filesystem_type = "ext4"
      + name                    = "spec-forge-data"
      + region                  = "ams3"
      + size                    = 10
      + urn                     = (known after apply)
    }

  # github_actions_secret.server_ip["spec-forge-api"] will be created
  + resource "github_actions_secret" "server_ip" {
      + created_at       = (known after apply)
      + destroy_on_drift = true
      + id               = (known after apply)
      + plaintext_value  = (sensitive value)
      + repository       = "spec-forge-api"
      + secret_name      = "SERVER_IP"
      + updated_at       = (known after apply)
    }

  # github_actions_secret.server_ip["spec-forge-front"] will be created
  + resource "github_actions_secret" "server_ip" {
      + created_at       = (known after apply)
      + destroy_on_drift = true
      + id               = (known after apply)
      + plaintext_value  = (sensitive value)
      + repository       = "spec-forge-front"
      + secret_name      = "SERVER_IP"
      + updated_at       = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + domain_name = "v-oleksiienko.xyz"
  + reserved_ip = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>